# Data Wrangling with pandas
## data filtering
## data normalization

In [179]:
import pandas as pd
import numpy as np
import seaborn as sns

In [180]:
kashti=sns.load_dataset("titanic")

In [181]:
kashti.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [182]:
# simple mathematic operation
#(kashti["age"]+1).head()

In [183]:
kashti.shape

(891, 15)

In [184]:
kashti.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [185]:
# drop na from deck column inplace =true mean value modified and don't returen anything and 
# inplace= false mean values modified and return the values mean it will show output
#kashti.drop(["deck"],axis=1) # this function will remove the entire column axis=1 means columns
kashti.dropna(subset=["deck"],axis=0,inplace=True) # this function remove or drop null rows axis=0 means rows

In [186]:
kashti.isnull().sum()

survived        0
pclass          0
sex             0
age            19
sibsp           0
parch           0
fare            0
embarked        2
class           0
who             0
adult_male      0
deck            0
embark_town     2
alive           0
alone           0
dtype: int64

In [187]:
kashti.shape

(203, 15)

In [188]:
# drop na from entire dataset
clean=kashti.dropna()
clean.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [189]:
clean.shape

(182, 15)

In [190]:
kashti.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [191]:
# replacing na with mean of the age column
# kashti["age"]=kashti["age"].replace(np.nan,np.mean)
# kashti.isnull().sum()

In [192]:
kashti.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [193]:
# convert data type from one to another
kashti["survived"]=kashti["survived"].astype("float") # we convert survived from int to float
# kashti["survived"].astype("float") # you can also do this

In [194]:
kashti.dtypes

survived        float64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [195]:
kashti.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1.0,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1.0,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0.0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1.0,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1.0,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

In [197]:
clean["age"]=clean["age"].astype("int")

C:\Users\lenovo\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [198]:
clean.dtypes

survived          int64
pclass            int64
sex              object
age               int32
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [200]:
# age in days
clean["age"]=clean["age"]*365
clean.head()

C:\Users\lenovo\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,5062550,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,4662875,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,7194150,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,532900,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,7727050,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

In [202]:
# convert the column name age into age in days
clean.rename(columns={"age":"age in days"},inplace=True)
clean.head()

C:\Users\lenovo\Anaconda3\lib\site-packages\pandas\core\frame.py:4025: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  return super(DataFrame, self).rename(**kwargs)

,survived,pclass,sex,age in days,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,5062550,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,4662875,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,7194150,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,532900,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,7727050,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

## methods of data normalization
1. simple featue scaling 
- x(new)=x(old)/x(max)
2. Min-max method
3. Z-score (standard score) -3 to +3
4. log tranformation

In [206]:
nd=clean[["age in days","fare"]]
nd.head()

    age in days     fare
1       5062550  71.2833
3       4662875  53.1000
6       7194150  51.8625
10       532900  16.7000
11      7727050  26.5500

- the above data is really in wide range and we need to normalize it is hard to compare
- notmalization change the values to the range 0 to 1 ( now both has similar influence on our models)

In [207]:
# first method
nd["fare"]=nd["fare"]/nd["fare"].max()
nd["age in days"]=nd["age in days"]/nd["age in days"].max()
nd.head()

C:\Users\lenovo\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

C:\Users\lenovo\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until

    age in days      fare
1        0.4750  0.139136
3        0.4375  0.103644
6        0.6750  0.101229
10       0.0500  0.032596
11       0.7250  0.051822